import math

# Введення коефіцієнтів рівняння
a = float(input("Введіть коефіцієнт a: "))
b = float(input("Введіть коефіцієнт b: "))
c = float(input("Введіть коефіцієнт c: "))


assert a != 0, "Коефіцієнт 'a' має бути відмінним від нуля (рівняння повинно бути квадратним)."

D = b**2 - 4*a*c

assert D >= 0, "Рівняння не має дійсних коренів (дискримінант менший за 0)."

if D == 0:
    x = -b / (2 * a)
    print(f"Рівняння має один корінь: x = {x}")
else:
    x1 = (-b + math.sqrt(D)) / (2 * a)
    x2 = (-b - math.sqrt(D)) / (2 * a)
    print(f"Рівняння має два корені: x1 = {x1}, x2 = {x2}")

